{
"10gen": {
  "name": "MongoDB by 10gen",
  "url": "http://www.mongodb.com",
  "logo": "mongodb.png",
  "category": "data-store",
  "contact":
    "10gen, Inc. <br/> 134 5th Avenue 3rd Floor <br/> New York, NY 10011 <br/> www.10gen.com",
  "summary":
    "MongoDB is a non-relational, open source database, combining scalability, performance and ease of use, with traditional relational database features such as dynamic queries and indexes. It has become a leading NoSQL database choice, with downloads exceeding 100,000 per month. 10gen develops MongoDB, and offers production support, training, and consulting for the database.",
  "quote": 
    "Red Hat OpenShift enables developers to focus on building applications, and dramatically reduces the upfront costs of deploying and scaling these new applications. The MongoDB NoSQL database is perfectly matched to the scalability and agility that developers demand in the cloud, and by supporting MongoDB in OpenShift, Red Hat has delivered that in an enterprise-ready open source platform.",
  "quote_attr":
    "Roger Bodamer, EVP Products and Technology at 10gen",
  "description":
    "<p>The MongoDB cartridge for OpenShift enables developers to store their application data in MongoDB, the NoSQL database of choice for thousands of Web 2.0 and Fortune 500 companies. MongoDB’s JSON-like document format with dynamic schemas simplifies application development, while its horizontal scalability allows for large-scale data storage and ‘big data’ analytics in cloud environments. The cartridge gives developers the power to quickly deploy, manage, and monitor high performance, highly-available clusters of the MongoDB database.</p>",
  "advantage": [
      "The power of NoSQL databases in an enterprise-ready open source platform",
      "Rapidly develop and iterate applications in many programming languages", 
      "Scale data storage needs quickly and safely"
    ],
  "availability": "Available now in developer preview",
  "availability_category": "now"
  },
"appcelerator": {
  "name": "Appcelerator", 
  "url": "http://www.appcelerator.com", 
  "logo": "appcelerator.png",
  "category": "ide",
  "contact":
    "Appcelerator <br/> 440 Bernardo Dr. <br/> Mountain View CA 94043",
  "summary": 
    "Appcelerator is the leading enterprise-grade, cross-device mobile development solution on the market today. With over 1.5 million developers worldwide, Appcelerator is the largest publisher of applications in the iPhone App Store.",
  "quote":
    "We're thrilled to be the first mobile development platform to be part of OpenShift.  Our integrated solution will enable developers to build and manage their mobile applications on Red Hat certified clouds.",
  "quote_attr":
    "Jeff Haynie, CEO of Appcelerator",
  "description":
    "<p>Developers can use Titanium to create, deploy, and manage mobile applications then push them to the Red Hat cloud with just one click. The only platform to enable fully native, cross-device development from a single code base for iOS, Android, and Blackberry, Appcelerator’s customers include NBC, PayPal, eBay, Orange, and Cisco. These companies develop their mobile applications on Appcelerator products so they can decrease time-to-market and development costs, increase customer adoption and revenues, and enjoy greater flexibility and control. For more information, please visit <a href=\"http://www.appcelerator.com\">www.appcelerator.com.</a></p>",
  "advantage":
    [ "Integrated solution for building, managing, and deploying cloud-connected mobile applications",
    "Familiar Eclipse-based IDE enables developers to create mobile cloud applications for Ruby, PHP, or Java",
    "One-click deployment to the Red Hat certified Cloud Provider Clouds"],
  "availability":
    "Available now in developer preview",
  "availability_category": "now"
  },
"bitnami": {
  "name": "BitNami",
  "url": "http://www.bitnami.com", 
  "logo": "bitnami.png",
  "category": "framework",
  "contact":
    "BitRock Inc. <br/> 1151 Marina Village Pkwy, Ste 101 <br/> Alameda, CA 94501",
  "summary": 
    "BitNami simplifies the deployment of open source and other applications natively, virtually, and in the cloud. Applications such as Alfresco, Drupal, SugarCRM, Wordpress, JasperServer, and more can be deployed in minutes using BitNami’s ready-to-run packages.",
  "quote":
    "We are excited to be partnering with Red Hat to enable developers to quickly deploy their favorite open source applications to the OpenShift Platform. Our BitNami-packaged applications give developers a head start so they can be productive with the OpenShift Platform in minutes.",
  "quote_attr":
    "Erica Brescia, CEO, BitRock (developer of BitNami)",
  "description":
    "<p>The BitNami cartridges for the OpenShift Platform enable developers to get up and running with their favorite open source applications in one click. Combined with OpenShift, the BitNami cartridges provide a complete, ready-to-run application stack and runtime environment. The growing BitNami application library includes SugarCRM, Alfresco, Drupal, Wordpress, JasperServer, Redmine, Joomla!, and many others.</p>",
  "advantage": [
    "BitNami application cartridges enable 1 click deployment of open source software on OpenShift.",
    "Choose from a library of popular applications for CRM, content management, blogging, and more."
  ],
  "availability": "Coming Soon",
  "availability_category": "eventually"
  },
"cotendo" : {
  "name": "Cotendo",
  "url": "http://www.cotendo.com",
  "logo": "cotendo.png",
  "category": "op-service",
  "contact": 
    "Cotendo inc. <br/> 530 Lakeside Drive <br/> Sunnyvale, CA 94085, USA",
  "summary":
    "Cotendo is a fast growing innovative provider of CDN and Site Acceleration services and a leader in the creation of technologies that allow website operators and large enterprises to significantly improve web performance and simplify content delivery management.",
  "quote":
    "At Cotendo we are obsessed with speed. We are excited to be the CDN and Site acceleration partner as part of Red Hat’s OpenShift ecosystem helping developers accelerate and scale their applications with demand.",
  "quote_attr":
    "Ronni Zehavi, CEO, Cotendo",
  "description":
    "<p>Cotendo delivers CDN and Site Acceleration through a services suite integrating dynamic and static content acceleration, SSL, CDN load-balancing, performance monitoring, real-time reporting, and more. Unified on a single platform, the superior performance and functionality of the Cotendo services suite enables clients to drive user engagement, conversions and maximize monetization. </p><p> Cotendo's customer base includes Fortune 500 enterprises, Tier 1 telecommunications providers, the world's largest social networks, eCommerce sites, advertising networks, and online gaming companies.</p>",
  "advantage":
    ["2x-10x faster performance than origin without the need for application architecture changes.",
    "Scale applications with demand without any additional infrastructure",
    "Direct, granular control with full transparency enable real-time adjustments to your content delivery"],
  "availability": "Available now in developer preview",
  "availability_category": "now"
  },
"couchbase" : {
  "name": "Couchbase",
  "url": "http://www.couchbase.com",
  "logo": "couchbase.png",
  "category": "data-store",
  "contact": 
    "200 West Evelyn Avenue <br/> Suite 110 <br/> Mountain View, CA 94041",
  "summary":
    "Couchbase products, which are built on Apache CouchDB, Membase, and memcached open source software, represent a comprehensive family of NoSQL solutions for building scalable web and mobile applications.",
  "quote":
    "With the OpenShift Platform, Red Hat has created a uniquely attractive PaaS offering that pairs choice with unified simplicity. Couch and memcached are two of the most prevalent open source technologies on the Web, and Couchbase is excited to deliver them as OpenShift cartridges, joining other best-of-breed open source technologies.",
  "quote_attr":
    "James Phillips, Co-founder, Couchbase",
  "description":
    "<p>Couchbase is a high-performance, elastic, key-value (NoSQL) database management system. Organizations including Zynga, AOL, the BBC and thousands of others power their interactive web applications with Couchbase. Because Couchbase supports the memcached protocol, mature and easy-to-use drivers are available for practically every programming language and environment including PHP, Ruby, Python, Perl, and Java.</p>",
  "advantage":
    ["Extremely easy to use and works out of the box with the most popular open source development stacks",
    "Highest-performance database technology with sub-millisecond latency keeps applications “snappy”",
    "Zero-downtime design means your application remains online through cluster maintenance"],
  "availability": "Available now in developer preview",
  "availability_category": "now"
  },
"dyn" : {
  "name": "Dyn",
  "url": "http://www.dyn.com",
  "logo": "dyn.png",
  "category": "op-service",
  "contact": 
    "150 Dow Street <br/> Manchester, NH 03101, USA",
  "summary":
    "Dyn Inc. is an Infrastructure as a Service (IaaS) provider for everyone from home users to the biggest online brands. With a range of innovative technologies, Dyn Inc. is a world leader in managed DNS and email delivery services providing “rock-solid” solutions on its three core brands, DynDNS.com, Dynect Platform and SendLabs.",
  "quote":
    "Dyn is very excited to be serving the Red Hat developer community with rock-solid, enterprise DNS and email delivery solutions for the OpenShift platform. As an official launch partner, we look forward to continuing our support for the open source community, as we have for more than 10 years.",
  "quote_attr":
    "Jeremy Hitchcock, CEO, Dyn",
  "description":
    "<p>Together, Red Hat and Dyn offer a one-stop solution for deploying your OpenShift based projects to a truly enterprise platform for DNS and email. Dyn provides enterprise class technology (ECT) including a globally redundant 17 datacenter managed anycast DNS service with active failover and elegant traffic management as well as an intelligent MTA platform for email delivery and inbox monitoring. With Red Hat and Dyn, uptime is the bottom line.",
  "advantage":
    ["Seamless management of mission critical DNS and email services.",
    "Enterprise power and rock-solid scalability from day one.",
    "Reliability and peace of mind in using industry-leading software, service, and support."],
  "availability": "Coming Soon",
  "availability_category": "eventually"
  },
"enterprisedb" : {
  "name": "EnterpriseDB",
  "url": "http://www.enterprisedb.com",
  "logo": "enterprisedb.png",
  "category": "data-store",
  "contact": 
    "34 Crosby Drive <br/> Suite 100 <br/> Bedford, MA 01730, USA",
  "summary":
    "EnterpriseDB, the enterprise PostgreSQL company, is a worldwide provider of database software, professional services, and production support for the world’s most advanced open source database--PostgreSQL. EnterpriseDB is also an industry leader in Oracle compatibility, providing customers with an Oracle-class database for up to 80% less cost. ",
  "quote":
    "EnterpriseDB is proud to be part of Red Hat’s OpenShift Platform, and is pleased to provide the open source developer with an enterprise-class, Oracle-compatible cloud database built and maintained through the proven open source development model.",
  "quote_attr":
    "Ed Boyajin, CEO, EnterpriseDB",
  "description":
    "<p>EnterpriseDB’s Postgres Plus Cloud Server allows developers to create, implement, and maintain scalable cloud database systems with point-and-click ease. Developers will enjoy the flexibility of being able to utilize all their favorite development languages with Postgres Plus Cloud Server, including Oracle PL/SQL. Developers can move existing Oracle applications to the cloud with little to no development changes and they can save up to 80% of their Oracle cost. Postgres Plus Cloud Server will be generally available this Fall.</p>",
  "advantage":
    ["Build scalable cloud database systems",
    "Supports all popular developer languages",
    "Move Oracle applications to the Cloud"],
  "availability": "Coming Soon",
  "availability_category": "eventually"
  },
"exo" : {
  "name": "eXo",
  "url": "http://www.cloud-ide.com",
  "logo": "exo.png",
  "category": "ide",
  "contact": 
    "eXo <br/> 51 Federal Street, Suite 305 <br/> San Francisco CA 94107, USA",
  "summary":
    "eXo offers a set of user experience services for building and deploying transactional websites, managing web and social content, and creating gadgets and dashboards for deployment on-premise, to mobile devices, or in cloud computing environments.",
  "quote":
    "eXo is pleased to expand our partnership with Red Hat to OpenShift. Our eXo Cloud Services provide a natural on-ramp for developers to OpenShift, offering an enhanced PaaS experience with the addition of rich social and collaborative development services.",
  "quote_attr":
    "Benjamin Mestrallet, CEO, eXo",
  "description":
    "<p>eXo Cloud IDE is a hosted development environment that enhances PaaS development by facilitating social coding--the collaborative development of gadgets, mashups, HTML5 and content apps. Git support allows a native integration with OpenShift. Developers can pull an application from Github, edit, test, and with a simple push of the app source code, automatically (re)deploy to the OpenShift PaaS. eXo Cloud IDE is a free service, available now; developers can create their own domains and invite others to collaborate.</p>",
  "advantage":
    ["OpenShift’s easy on-ramp and eXo Cloud IDE’s collaborative development approach are ideal for open source developers.",
    "Developing mashups in eXo Cloud IDE is easier with the OpenShift platform's choice of frameworks, languages and APIs.",
    "Because deployment to OpenShift is automatic via Git, developers can test as they code, speeding development."],
  "availability": "Available now in developer preview",
  "availability_category": "now"
  },
"mu-dynamics" : {
  "name": "Mu Dynamics",
  "url": "http://blitz.io",
  "logo": "mudynamics.png",
  "category": "op-service",
  "contact": 
    "686 W Maude Avenue, Ste 104 <br/> Sunnyvale, CA 94085, USA",
  "summary":
    "Mu Dynamics is a leader in load and performance testing for cloud infrastructure and apps. Our innovative solutions enable customers to rapidly address application performance and ensure that their cloud infrastructure and applications are functional, scalable and secure.",
  "quote":
    "We are excited to be a provider of application acceleration and performance testing for the Red Hat OpenShift Platform. With open source making cloud deployments incredibly agile, blitz.io from Mu Dynamics helps scale these apps by bringing load and performance testing into the development cycle to deliver a better user experience while simultaneously speeding time to deployment.",
  "quote_attr":
    "Kowsik Guruswamy, CTO/Co-Founder, Mu Dynamics",
  "description":
    "<p>blitz.io, from Mu Dynamics, is a fully cloud-enabled load and performance testing solution. With an interface that resembles cURL, blitz.io makes it very easy for developers to deploy with the OpenShift Platform and instantly determine the scalability of their apps. The chrome extension and the RESTful API further enable developers to easily integrate load and performance testing into the development cycle. </p>",
  "advantage":
    ["blitz.io adapts common dev tools to make load and performance testing simple and easy",
    "The RESTful API allow developers to integrate performance testing into their development cycle",
    "By automatically recreating production workloads, blitz.io eliminates complex test scripts"],
  "availability": "Available now in developer preview",
  "availability_category": "now"
  },
"opencrowd" : {
  "name": "Opencrowd",
  "url": "http://www.opencrowd.com",
  "logo": "opencrowd.png",
  "category": "data-store",
  "contact": 
    "41 East 11th Street, 11th Floor <br/> New York, NY 10003",
  "summary":
    "OpenCrowd is a user experience and technology services firm that builds Collaboration-centric applications. OpenCrowd’s primary focus is building custom Collaborative Dashboards, Business-Social Media, and Mobile applications on cloud platforms. OpenCrowd has delivered solutions across a wide spectrum of firms ranging from IBM and premium investment banks to early start-ups like PlumLife.",
  "quote":
    "By integrating our python-based product with the OpenShift platform our clients can now benefit from a ready-made, enterprise-class environment for their custom solutions",
  "quote_attr":
    "Sushil Prabhu - CEO, OpenCrowd",
  "description":
    "<p>OpenCrowd’s Collaboration Application Builder (CAB) integrated with Red Hat’s OpenShift platform, will provide a comprehensive environment to rapidly build and launch a variety of collaboration-centric applications in weeks. The CAB environment will include an extended set of prefabricated  plug-ins that will have features like rich data visualization, workspace creation, on-demand OLAP, video, chat, search, and more. The CAB environment leverages Django, a python-based web framework. The product will be officially launched for public use in July.</p>",
  "advantage":
    ["Build collaboration-centric apps in weeks and launch in a production-ready environment in hours",
    "Provide enterprise-grade reliability and security to your business intelligence and enterprise collaboration applications",
    "Scale quickly on-demand to support your social media applications",
    "Enrich and extend your application environment by leveraging OpenShift services like CDN, Caching, and Bigdata"],
  "availability": "Coming Soon",
  "availability_category": "eventually"
  },
"opsource" : {
  "name": "OpSource",
  "url": "http://www.opsource.net",
  "logo": "opsource.png",
  "category": "cloud-provider",
  "contact": 
    "5201 Great America Pkwy, Suite 120 <br/> Santa Clara, CA 95112, USA",
  "summary":
    "OpSource™ provides enterprise cloud and managed hosting solutions that enable businesses to accelerate growth and scale operations while controlling costs. Hundreds of SaaS ISVs, cloud platform providers, carriers and enterprises rely on OpSource.",
  "quote":
    "Enterprise-ready development platforms that are based on open standards are a key driver of the adoption of Infrastructure-as-a-Service and one of the fastest growing uses of the cloud. Being a Red Hat OpenShift Public Cloud Provider provides OpSource customers and our partners with access to a platform and a trusted open source community to accelerate the development of enterprise-class applications in the cloud.",
  "quote_attr":
    "John Rowell, CTO, OpSource",
  "description":
    "<p>OpSource is the only enterprise cloud IaaS offering that includes hardware-based security and scalability, complete customization and control, easy integration, 24x7 live support and 100% availability guaranteed. Developers select OpSource as the IaaS layer for OpenShift to get pay-as-you-go compute power with enterprise-class security, performance, and control for their Red Hat environments. The OpenShift platform should be available on the OpSource Cloud Q3 2011.</p>",
  "advantage":
    ["Infrastructure built on enterprise-grade technology and carrier-class networks",
    "Best-in-class physical, network, and end user security technology and policy rules controls",
    "Pay only for what you use; scale up and down in minutes based on application demand, workload and dev cycle"],
  "availability": "Expected Q3, 2011",
  "availability_category": "soon"
  },
"zend" : {
  "name": "Zend",
  "url": "http://www.zend.com",
  "logo": "zend.png",
  "category": "framework",
  "contact": 
    "Zend Technologies, Inc. <br/> 19200 Stevens Creek Blvd., Suite 100 <br/> Cupertino, CA  95014",
  "summary":
    "Zend is a leading provider of software solutions for developing and managing business-critical PHP applications. The Zend PHP Cloud Platform is an elastic, manageable, cloud-portable platform that offers fast on-boarding, scalability, and high availability.",
  "quote":
    "We are excited to be part of the Red Hat OpenShift ecosystem, and enable PHP developers to get the full benefits of the Zend PHP Cloud Platform through the Red Hat OpenShift Platform.",
  "quote_attr":
    "Andi Gutmans, CEO and Co-founder, Zend Technologies",
  "description":
    "<p>The Zend PHP cloud application platform offers rapid development and deployment of business-critical PHP applications with high availability, massive scalability, and portability in the cloud. The platform includes the open source Zend framework for accessing cloud services and writing portable code using the SimpleCloud API; an enterprise-grade, optimized PHP stack, application monitoring, root cause diagnostics, and resource management.</p>",
  "advantage":
    ["Elasticity and high availability for PHP applications",
    "Portability across different clouds and flexibility to customize your environment",
    "Early problem detection and swift root cause analysis through PHP monitoring and code tracing"],
  "availability": "Available now in developer preview",
  "availability_category": "now"
  }
} 
